docs/examples.md

---
title: Examples (Version 1)
---


Bank code lookup
----------------

### Example request (generated by soapUI):

I recommend using the awesome parser coming with soapUI to generate sample requests for your
service and use those as blueprints for setting up Savon and executing SOAP requests.

``` xml
<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:blz="http://thomas-bayer.com/blz/">
  <soapenv:Header/>
  <soapenv:Body>
    <blz:getBank>
      <blz:blz>?</blz:blz>
    </blz:getBank>
  </soapenv:Body>
</soapenv:Envelope>
```

### SOAP request (using the WSDL):

Usually you will pass a block to the `#request` method, but the method also accepts a Hash
to specify attributes for the input tag. Now since there's only one parameter, the following
example uses a little shortcut. Instead of setting the SOAP body inside a block, it passes
it through the attributes Hash under a special key called `:body`.

``` ruby
client = Savon.client("http://www.thomas-bayer.com/axis2/services/BLZService?wsdl")
response = client.request :get_bank, :body => { :blz => "70070010" }
```

Response via `response.body[:get_bank_response][:details]`

``` ruby
{ :plz => "80271", :bic => "DEUTDEMMXXX", :ort => "München", :bezeichnung => "Deutsche Bank" }
```

### SOAP request (without the WSDL):

Instead of using the WSDL document, you specify the endpoint and namespace.
Also, since the service expects `<blz:blz>?</blz:blz>` to be namespaced,
`#element_form_default` is set to `:qualified`.

``` ruby
client = Savon.client do
  wsdl.endpoint = "http://www.thomas-bayer.com/axis2/services/BLZService"
  wsdl.namespace = "http://thomas-bayer.com/blz/"
end

response = client.request(:blz, :get_bank) do
  soap.element_form_default = :qualified
  soap.body = { :blz => "70070010" }
end
```

As you can see, when based on a WSDL, the client automatically sets the endpoint, namespace
and knows the service specified `elementFormDefault="qualified"`.

An alternative to specifying `#element_form_default`, you can use a String key to manually
specify a namespace for the XML tag. Savon sets the namespace to the first parameter in the
next example.

``` ruby
response = client.request(:blz, :get_bank) do
  soap.body = { "blz:blz" => "70070010" }
end
```

### Debugging problems

In case you're having a hard time interacting with a service, use the debug output in development
to compare the request executed by Savon to the request generated by soapUI. It may help you.

``` bash
DEBUG -- : SOAP request: http://www.thomas-bayer.com/axis2/services/BLZService
DEBUG -- : SOAPAction: "getBank", Content-Type: text/xml;charset=UTF-8

DEBUG -- : <env:Envelope
DEBUG -- :     xmlns:blz="http://thomas-bayer.com/blz/"
DEBUG -- :     xmlns:xsd="http://www.w3.org/2001/XMLSchema"
DEBUG -- :     xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
DEBUG -- :     xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
DEBUG -- :   <env:Body>
DEBUG -- :     <blz:getBank>
DEBUG -- :       <blz:blz>70070010</blz:blz>
DEBUG -- :     </blz:getBank>
DEBUG -- :   </env:Body>
DEBUG -- : </env:Envelope>
```


eBay's official time
--------------------

### Example request (generated by soapUI):

The example request is huge but also quite interesting.

``` xml
<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:urn="urn:ebay:apis:eBLBaseComponents">
  <soapenv:Header>
    <urn:RequesterCredentials>
      <!--Optional:-->
      <urn:eBayAuthToken>?</urn:eBayAuthToken>
      <!--Optional:-->
      <urn:HardExpirationWarning>?</urn:HardExpirationWarning>
      <!--Optional:-->
      <urn:Credentials>
        <!--Optional:-->
        <urn:AppId>?</urn:AppId>
        <!--Optional:-->
        <urn:DevId>?</urn:DevId>
        <!--Optional:-->
        <urn:AuthCert>?</urn:AuthCert>
        <!--Optional:-->
        <urn:Username>?</urn:Username>
        <!--Optional:-->
        <urn:Password>?</urn:Password>
        <!--You may enter ANY elements at this point-->
      </urn:Credentials>
      <!--Optional:-->
      <urn:NotificationSignature>?</urn:NotificationSignature>
      <!--You may enter ANY elements at this point-->
    </urn:RequesterCredentials>
  </soapenv:Header>
  <soapenv:Body>
    <urn:GeteBayOfficialTimeRequest>
      <!--Zero or more repetitions:-->
      <urn:DetailLevel>?</urn:DetailLevel>
      <!--Optional:-->
      <urn:ErrorLanguage>?</urn:ErrorLanguage>
      <!--Optional:-->
      <urn:MessageID>?</urn:MessageID>
      <!--Optional:-->
      <urn:Version>?</urn:Version>
      <!--Optional:-->
      <urn:EndUserIP>?</urn:EndUserIP>
      <!--Optional:-->
      <urn:ErrorHandling>?</urn:ErrorHandling>
      <!--Optional:-->
      <urn:InvocationID>?</urn:InvocationID>
      <!--Zero or more repetitions:-->
      <urn:OutputSelector>?</urn:OutputSelector>
      <!--Optional:-->
      <urn:WarningLevel>?</urn:WarningLevel>
      <!--Optional:-->
      <urn:BotBlock>
        <!--Optional:-->
        <urn:BotBlockToken>?</urn:BotBlockToken>
        <!--Optional:-->
        <urn:BotBlockUserInput>?</urn:BotBlockUserInput>
        <!--You may enter ANY elements at this point-->
      </urn:BotBlock>
      <!--You may enter ANY elements at this point-->
    </urn:GeteBayOfficialTimeRequest>
  </soapenv:Body>
</soapenv:Envelope>
```

### SOAP request (using the WSDL):

I started reading through an example entitled
["Executing Your First C# Call"](http://developer.ebay.com/DevZone/XML/docs/HowTo/FirstCall/MakingCallCSharp.html),
requested access to the eBay API and created a sandbox user with a token.

> The request URL should contain the URL to the eBay service, the call name, the site ID,
> your application ID, the WSDL version number, and the special parameter routing=default.
> The routing=default ensures that your call reaches the eBay single-namespace WSDL.

So let's set some variables and create the endpoint with additional parameters.

``` ruby
endpoint = "https://api.sandbox.ebay.com/wsapi"
action   = "GeteBayOfficialTime"
version  = 405

app_id   = "SomeGuy-9x31-3bf3-8686-6f91e78885bb"
dev_id   = "f1f71838-d5c7-4102-8b7d-a093be6e3097"
cert_id  = "da85e415-454f-50ad-a58c-2b52efff5d85"

endpoint_with_params = endpoint +
  "?callname=#{action}&siteid=0&appid=#{app_id}&version=#{version}&routing=default"
```

eBay's WSDL document has a size of almost 5MB and the next example uses a local copy of it.
Each client instance downloads and parses a WSDL document only once. But it's still a
performance penalty.

``` ruby
client = Savon.client File.expand_path("../wsdl/ebay.xml", __FILE__)
```

Now for the request, notice that the SOAP action to call is passed as a String `"GeteBayOfficialTime"`
instead of a Symbol, because Symbols are converted to lowerCamelCase.

``` ruby
client.request :urn, "GeteBayOfficialTime" do
  soap.endpoint = endpoint_with_params
  soap.header = {
    "urn:RequesterCredentials" => {
      "urn:eBayAuthToken" => "AgA*AQAyszGY/KpYwHykNngbmS8PqT3Dl839ktogQNAk6h",
      "urn:Credentials" => {
        "urn:AppId" => app_id, "urn:DevId" => dev_id, "urn:AuthCert" => cert_id
      }
    }
  }
  soap.body = { "Version" => version }
end
```

`endpoint_with_params` was set and the SOAP header is passed as a Hash just like the SOAP body.  
Again, the `"Version"` parameter is a String instead of a Symbol so it's not converted to lowerCamelCase.

Response via `response.body[:gete_bay_official_time_response]`

``` ruby
{
  :ack       => "Success",
  :timestamp => #<DateTime: 21216860402497/8640000,0,2299161>,
  :version   => "713",
  :build     => "E713_CORE_BUNDLED_12912639_R1"
}
```

### SOAP request (without the WSDL):

Instead of overwriting the endpoint read from the WSDL, here `endpoint_with_params` and the namespace
are specified manually when creating the client.

``` ruby
client = Savon.client do
  wsdl.endpoint = endpoint_with_params
  wsdl.namespace = "urn:ebay:apis:eBLBaseComponents"
end

response = client.request :urn, "GeteBayOfficialTime" do
  soap.header = {
    "urn:RequesterCredentials" => {
      "urn:eBayAuthToken" => "AgAAAA**AQAAAA**aAAogQNAk6h",
      "urn:Credentials" => {
        "urn:AppId" => app_id, "urn:DevId" => dev_id, "urn:AuthCert" => cert_id
      }
    }
  }
  soap.body = { "urn:Version" => 405 }
end
```

Since the SOAP body requires only one parameter, instead of setting `#element_form_default`
to `:qualified`, `"urn:Version"` is specified as a namespaced String. Here's the raw request:

``` xml
<env:Envelope
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:urn="urn:ebay:apis:eBLBaseComponents"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
  <env:Header>
    <urn:RequesterCredentials>
      <urn:eBayAuthToken>AgAAAA**AQAAAA**aAAogQNAk6h</urn:eBayAuthToken>
      <urn:Credentials>
        <urn:DevId>f1f71838-d5c7-4102-8b7d-a093be6e3097</urn:DevId>
        <urn:AppId>SomeGuy-9x31-3bf3-8686-6f91e78885bb</urn:AppId>
        <urn:AuthCert>da85e415-454f-50ad-a58c-2b52efff5d85</urn:AuthCert>
      </urn:Credentials>
    </urn:RequesterCredentials>
  </env:Header>
  <env:Body>
    <urn:GeteBayOfficialTime>
      <urn:Version>405</urn:Version>
    </urn:GeteBayOfficialTime>
  </env:Body>
</env:Envelope>
```
